tutorials/Free_Flow_Cases/Capillary_Rise/porous_Boundary/0/eps
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16000
(
0.001
0.001
0.001
0.001
0.001
0.001
0.001
0.001
...
)
;

boundaryField
{
    atmosphere
    {
        type            fixedValue;
        value           uniform 1;
    }
    topPorous
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    inletPorous
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
